import React from 'react'
import styles from './explan.module.css'


const Explanation = () => {
  return (
    <div className={styles.explanBox}>
      <div className={styles.explanTitleBox}>
        <p>직무와 관련된 전문 지식과 기술을 꾸준히 채워갑니다.</p>
      </div>
      <div>
        <p>다양한 프로그래밍 언어와 개발 도구를 활용하며,
          <br /> 직무와 관련된 전문 지식과 기술을 꾸준히 쌓아가고 있습니다.
          <br /> 프로젝트 기반 학습과 온라인 플랫폼을 통한 이론 학습,
          <br /> 그리고 커뮤니티 활동을 통해 최신 트렌드를 익히고 실무 경험을 확장하며 기술 이해도를 지속적으로 높이고 있습니다</p>
        <br />
        앞으로는 보다 체계적인 학습 계획을 수립하여 구체적인 목표를 설정하고,
        이를 달성하기 위해 매일 꾸준히 노력할 것입니다.
        <br />최신 기술과 개발 동향에 대한 관심을 유지하며, <br />
        새로운 도구와 언어에도 적극적으로 도전할 계획입니다.
        특히, 오픈 소스 프로젝트에 기여하거나, 협업 경험을 넓힐 수 있는 활동에 참여함으로써, 실무 역량과 문제 해결 능력을 강화하고자 합니다. <br />
        또한, 지속 가능한 코드와 품질 높은 소프트웨어 개발을 목표로, 설계 및 유지보수 관점에서도 깊이 있는 이해를 갖추기 위해 학습을 이어갈 것입니다.<br />
        이 모든 과정에서, 단순히 기술 습득에 그치지 않고, 문제를 해결하고 가치를 창출할 수 있는 개발자로 성장하겠다는 다짐을 하고 있습니다.
      </div>
    </div>
  )
}

export default Explanation
